In [1]:
SELECT * FROM Person;

SyntaxError: invalid syntax (<ipython-input-1-55bc8a1902cc>, line 1)

## Useful IPython Magic Command for writing SQL in Jupyter Notebooks!

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///../data/survey.db

In [4]:
%sql SELECT * FROM Person;

 * sqlite:///../data/survey.db
Done.

[('dyer', 'William', 'Dyer'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('roe', 'Valentina', 'Roerich'),
 ('danforth', 'Frank', 'Danforth')]

In [5]:
%%sql
SELECT * FROM Person
;

 * sqlite:///../data/survey.db
Done.

[('dyer', 'William', 'Dyer'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('roe', 'Valentina', 'Roerich'),
 ('danforth', 'Frank', 'Danforth')]

## How to run Sqlite commands like .schema or .tables?

In [16]:
# TODO put the answer!

## Sorting and Removing Duplicates

In [6]:
%sql SELECT quant FROM Survey;

 * sqlite:///../data/survey.db
Done.

[('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('sal',),
 ('rad',)]

In [7]:
%sql SELECT DISTINCT quant FROM Survey;

 * sqlite:///../data/survey.db
Done.

[('rad',), ('sal',), ('temp',)]

In [8]:
%sql SELECT DISTINCT taken, quant FROM Survey;

 * sqlite:///../data/survey.db
Done.

[(619, 'rad'),
 (619, 'sal'),
 (622, 'rad'),
 (622, 'sal'),
 (734, 'rad'),
 (734, 'sal'),
 (734, 'temp'),
 (735, 'rad'),
 (735, 'sal'),
 (735, 'temp'),
 (751, 'rad'),
 (751, 'temp'),
 (751, 'sal'),
 (752, 'rad'),
 (752, 'sal'),
 (752, 'temp'),
 (837, 'rad'),
 (837, 'sal'),
 (844, 'rad')]

In [9]:
%sql SELECT * FROM Person ORDER BY id;

 * sqlite:///../data/survey.db
Done.

[('danforth', 'Frank', 'Danforth'),
 ('dyer', 'William', 'Dyer'),
 ('lake', 'Anderson', 'Lake'),
 ('pb', 'Frank', 'Pabodie'),
 ('roe', 'Valentina', 'Roerich')]

In [10]:
%sql SELECT * FROM Person ORDER BY id DESC;

 * sqlite:///../data/survey.db
Done.

[('roe', 'Valentina', 'Roerich'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('dyer', 'William', 'Dyer'),
 ('danforth', 'Frank', 'Danforth')]

In [11]:
%sql SELECT * FROM Person ORDER BY id ASC;

 * sqlite:///../data/survey.db
Done.

[('danforth', 'Frank', 'Danforth'),
 ('dyer', 'William', 'Dyer'),
 ('lake', 'Anderson', 'Lake'),
 ('pb', 'Frank', 'Pabodie'),
 ('roe', 'Valentina', 'Roerich')]

In [12]:
%sql SELECT taken, person, quant FROM Survey ORDER BY taken ASC, person DESC;

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'rad'),
 (619, 'dyer', 'sal'),
 (622, 'dyer', 'rad'),
 (622, 'dyer', 'sal'),
 (734, 'pb', 'rad'),
 (734, 'pb', 'temp'),
 (734, 'lake', 'sal'),
 (735, 'pb', 'rad'),
 (735, None, 'sal'),
 (735, None, 'temp'),
 (751, 'pb', 'rad'),
 (751, 'pb', 'temp'),
 (751, 'lake', 'sal'),
 (752, 'roe', 'sal'),
 (752, 'lake', 'rad'),
 (752, 'lake', 'sal'),
 (752, 'lake', 'temp'),
 (837, 'roe', 'sal'),
 (837, 'lake', 'rad'),
 (837, 'lake', 'sal'),
 (844, 'roe', 'rad')]

In [17]:
%%sql
SELECT taken, person, quant FROM Survey
ORDER BY taken ASC, person DESC;

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'rad'),
 (619, 'dyer', 'sal'),
 (622, 'dyer', 'rad'),
 (622, 'dyer', 'sal'),
 (734, 'pb', 'rad'),
 (734, 'pb', 'temp'),
 (734, 'lake', 'sal'),
 (735, 'pb', 'rad'),
 (735, None, 'sal'),
 (735, None, 'temp'),
 (751, 'pb', 'rad'),
 (751, 'pb', 'temp'),
 (751, 'lake', 'sal'),
 (752, 'roe', 'sal'),
 (752, 'lake', 'rad'),
 (752, 'lake', 'sal'),
 (752, 'lake', 'temp'),
 (837, 'roe', 'sal'),
 (837, 'lake', 'rad'),
 (837, 'lake', 'sal'),
 (844, 'roe', 'rad')]

In [18]:
%%sql
SELECT DISTINCT quant, person FROM SURVEY
ORDER BY quant ASC;

 * sqlite:///../data/survey.db
Done.

[('rad', 'dyer'),
 ('rad', 'pb'),
 ('rad', 'lake'),
 ('rad', 'roe'),
 ('sal', 'dyer'),
 ('sal', 'lake'),
 ('sal', None),
 ('sal', 'roe'),
 ('temp', 'pb'),
 ('temp', None),
 ('temp', 'lake')]

#### Exercise: Selecting distinct dates from the Visited table?

In [22]:
%sql SELECT DISTINCT dated FROM Visited;

 * sqlite:///../data/survey.db
Done.

[('1927-02-08',),
 ('1927-02-10',),
 ('1930-01-07',),
 ('1930-01-12',),
 ('1930-02-26',),
 (None,),
 ('1932-01-14',),
 ('1932-03-22',)]

#### If two missing values in a table are they treated as distinct?

In [23]:
%sql SELECT person FROM Survey;

 * sqlite:///../data/survey.db
Done.

[('dyer',),
 ('dyer',),
 ('dyer',),
 ('dyer',),
 ('pb',),
 ('lake',),
 ('pb',),
 ('pb',),
 (None,),
 (None,),
 ('pb',),
 ('pb',),
 ('lake',),
 ('lake',),
 ('lake',),
 ('lake',),
 ('roe',),
 ('lake',),
 ('lake',),
 ('roe',),
 ('roe',)]

In [24]:
%sql SELECT DISTINCT person FROM Survey;

 * sqlite:///../data/survey.db
Done.

[('dyer',), ('pb',), ('lake',), (None,), ('roe',)]

## Filtering

In [25]:
%%sql
SELECT * FROM Visited
WHERE site = 'DR-1';

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (844, 'DR-1', '1932-03-22')]

In [26]:
%%sql
SELECT id FROM Visited
WHERE site = 'DR-1';

 * sqlite:///../data/survey.db
Done.

[(619,), (622,), (844,)]

In [27]:
%%sql
SELECT * FROM Visited
WHERE site = 'DR-1' AND dated < '1930-01-01';

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'), (622, 'DR-1', '1927-02-10')]

In [28]:
%%sql
SELECT * FROM Survey
WHERE person = 'lake' OR person = 'roe';

 * sqlite:///../data/survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [29]:
%%sql
SELECT * FROM Survey
WHERE person IN ('lake', 'roe');

 * sqlite:///../data/survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [30]:
%%sql
SELECT * FROM Survey
WHERE quant = 'sal' AND person = 'lake' OR person = 'roe';

 * sqlite:///../data/survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'sal', 0.09),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [31]:
%%sql
SELECT * FROM Survey
WHERE quant = 'sal' AND (person = 'lake' OR person = 'roe');

 * sqlite:///../data/survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'sal', 0.09),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5)]

In [32]:
%%sql
SELECT * FROM Visited;

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (837, 'MSK-4', '1932-01-14'),
 (844, 'DR-1', '1932-03-22')]

In [33]:
%%sql
SELECT * FROM Visited
WHERE site = 'DR-1' OR site = 'DR-3';

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (844, 'DR-1', '1932-03-22')]

In [34]:
%%sql
SELECT * FROM Visited
WHERE site LIKE 'DR%';

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (844, 'DR-1', '1932-03-22')]

#### How to select all persons from survey that start with 'l' and end with 'e'?

In [42]:
%%sql
SELECT * FROM Survey
WHERE person LIKE 'l%e';

 * sqlite:///../data/survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21)]

In [44]:
%%sql
SELECT DISTINCT person, quant FROM Survey
WHERE person IN ('lake', 'roe');

 * sqlite:///../data/survey.db
Done.

[('lake', 'sal'),
 ('lake', 'rad'),
 ('lake', 'temp'),
 ('roe', 'sal'),
 ('roe', 'rad')]

If you break the above query into stages of execution it would have the following three stages...

In [45]:
%%sql
SELECT * FROM Survey
WHERE person IN ('lake', 'roe');

 * sqlite:///../data/survey.db
Done.

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [46]:
%%sql
SELECT person, quant FROM Survey
WHERE person IN ('lake', 'roe');

 * sqlite:///../data/survey.db
Done.

[('lake', 'sal'),
 ('lake', 'sal'),
 ('lake', 'rad'),
 ('lake', 'sal'),
 ('lake', 'temp'),
 ('roe', 'sal'),
 ('lake', 'rad'),
 ('lake', 'sal'),
 ('roe', 'sal'),
 ('roe', 'rad')]

In [47]:
%%sql
SELECT DISTINCT person, quant FROM Survey
WHERE person IN ('lake', 'roe');

 * sqlite:///../data/survey.db
Done.

[('lake', 'sal'),
 ('lake', 'rad'),
 ('lake', 'temp'),
 ('roe', 'sal'),
 ('roe', 'rad')]

## Calculating New Values

In [51]:
%%sql
SELECT 1.05 * reading FROM Survey
WHERE quant = 'rad';

 * sqlite:///../data/survey.db
Done.

[(10.311,),
 (8.19,),
 (8.8305,),
 (7.581,),
 (4.5675,),
 (2.2995,),
 (1.533,),
 (11.8125,)]

In [53]:
%%sql
SELECT taken, round(5 * (reading - 32) / 9, 2) FROM Survey
WHERE quant = 'temp';

 * sqlite:///../data/survey.db
Done.

[(734, -29.72), (735, -32.22), (751, -28.06), (752, -26.67)]

In [54]:
%%sql
SELECT taken, round(5 * (reading - 32) / 9, 2) AS celsius FROM Survey
WHERE quant = 'temp';

 * sqlite:///../data/survey.db
Done.

[(734, -29.72), (735, -32.22), (751, -28.06), (752, -26.67)]

In [59]:
%%sql
SELECT personal || ' ' || family AS 'Full Name'  FROM Person;

 * sqlite:///../data/survey.db
Done.

[('William Dyer',),
 ('Frank Pabodie',),
 ('Anderson Lake',),
 ('Valentina Roerich',),
 ('Frank Danforth',)]

In [65]:
%%sql
SELECT taken, round(0.3 * taken, 3) FROM Survey;

 * sqlite:///../data/survey.db
Done.

[(619, 185.7),
 (619, 185.7),
 (622, 186.6),
 (622, 186.6),
 (734, 220.2),
 (734, 220.2),
 (734, 220.2),
 (735, 220.5),
 (735, 220.5),
 (735, 220.5),
 (751, 225.3),
 (751, 225.3),
 (751, 225.3),
 (752, 225.6),
 (752, 225.6),
 (752, 225.6),
 (752, 225.6),
 (837, 251.1),
 (837, 251.1),
 (837, 251.1),
 (844, 253.2)]

In [68]:
%%sql
SELECT taken, taken * 100, taken / 100.0 FROM Survey;

 * sqlite:///../data/survey.db
Done.

[(619, 61900, 6.19),
 (619, 61900, 6.19),
 (622, 62200, 6.22),
 (622, 62200, 6.22),
 (734, 73400, 7.34),
 (734, 73400, 7.34),
 (734, 73400, 7.34),
 (735, 73500, 7.35),
 (735, 73500, 7.35),
 (735, 73500, 7.35),
 (751, 75100, 7.51),
 (751, 75100, 7.51),
 (751, 75100, 7.51),
 (752, 75200, 7.52),
 (752, 75200, 7.52),
 (752, 75200, 7.52),
 (752, 75200, 7.52),
 (837, 83700, 8.37),
 (837, 83700, 8.37),
 (837, 83700, 8.37),
 (844, 84400, 8.44)]

## Missing Data

In [66]:
%%sql
SELECT * FROM Visited;

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (837, 'MSK-4', '1932-01-14'),
 (844, 'DR-1', '1932-03-22')]

In [69]:
%%sql
SELECT * FROM Visited
WHERE dated < '1930-01-01';

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'), (622, 'DR-1', '1927-02-10')]

In [70]:
%%sql
SELECT * FROM Visited
WHERE dated >= '1930-01-01';

 * sqlite:///../data/survey.db
Done.

[(734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (837, 'MSK-4', '1932-01-14'),
 (844, 'DR-1', '1932-03-22')]

In [71]:
%%sql
SELECT * FROM Visited
WHERE dated = NULL;

 * sqlite:///../data/survey.db
Done.

[]

In [72]:
%%sql
SELECT * FROM Visited
WHERE dated != NULL;

 * sqlite:///../data/survey.db
Done.

[]

In [73]:
%%sql
SELECT * FROM Visited
WHERE dated IS NULL;

 * sqlite:///../data/survey.db
Done.

[(752, 'DR-3', None)]

In [74]:
%%sql
SELECT * FROM Visited
WHERE dated IS NOT NULL;

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (837, 'MSK-4', '1932-01-14'),
 (844, 'DR-1', '1932-03-22')]

In [77]:
%%sql
SELECT * FROM Survey
WHERE quant = 'sal' AND person != 'lake';

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'sal', 0.09),
 (752, 'roe', 'sal', 41.6),
 (837, 'roe', 'sal', 22.5)]

In [78]:
%%sql
SELECT * FROM Survey
WHERE quant = 'sal' AND (person != 'lake' OR person IS NULL);

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'sal', 0.09),
 (735, None, 'sal', 0.06),
 (752, 'roe', 'sal', 41.6),
 (837, 'roe', 'sal', 22.5)]

## Aggregation

In [86]:
%%sql
SELECT dated FROM Visited;

 * sqlite:///../data/survey.db
Done.

[('1927-02-08',),
 ('1927-02-10',),
 ('1930-01-07',),
 ('1930-01-12',),
 ('1930-02-26',),
 (None,),
 ('1932-01-14',),
 ('1932-03-22',)]

In [87]:
%sql SELECT min(dated) FROM Visited;

 * sqlite:///../data/survey.db
Done.

[('1927-02-08',)]

In [88]:
%sql SELECT max(dated) FROM Visited;

 * sqlite:///../data/survey.db
Done.

[('1932-03-22',)]

In [93]:
%%sql
SELECT round(avg(reading), 3) FROM Survey
WHERE quant = 'sal';

 * sqlite:///../data/survey.db
Done.

[(7.203,)]

In [94]:
%%sql
SELECT count(reading) FROM Survey
WHERE quant = 'sal';

 * sqlite:///../data/survey.db
Done.

[(9,)]

In [96]:
%%sql
SELECT round(sum(reading), 2) FROM Survey
WHERE quant = 'sal';

 * sqlite:///../data/survey.db
Done.

[(64.83,)]

In [97]:
%%sql
SELECT min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'sal' AND reading <= 1.0;

 * sqlite:///../data/survey.db
Done.

[(0.05, 0.10428571428571429, 0.21)]

The above query executes as follows...

In [98]:
%%sql
SELECT * FROM Survey
WHERE quant = 'sal' AND reading <= 1.0;

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'sal', 0.09),
 (734, 'lake', 'sal', 0.05),
 (735, None, 'sal', 0.06),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'sal', 0.09),
 (837, 'lake', 'sal', 0.21)]

In [99]:
%%sql
SELECT reading, reading, reading FROM Survey
WHERE quant = 'sal' AND reading <= 1.0;

 * sqlite:///../data/survey.db
Done.

[(0.13, 0.13, 0.13),
 (0.09, 0.09, 0.09),
 (0.05, 0.05, 0.05),
 (0.06, 0.06, 0.06),
 (0.1, 0.1, 0.1),
 (0.09, 0.09, 0.09),
 (0.21, 0.21, 0.21)]

In [100]:
%%sql
SELECT min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'sal' AND reading <= 1.0;

 * sqlite:///../data/survey.db
Done.

[(0.05, 0.10428571428571429, 0.21)]

In [103]:
%%sql
SELECT person, count(*) FROM Survey
WHERE quant = 'sal' AND reading <= 1.0;

 * sqlite:///../data/survey.db
Done.

[('dyer', 7)]

In [104]:
%%sql
SELECT min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'sal' AND reading <= 0.0;

 * sqlite:///../data/survey.db
Done.

[(None, None, None)]

In [105]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'rad';

 * sqlite:///../data/survey.db
Done.

[('roe', 8, 1.46, 6.5625, 11.25)]

In [106]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'rad' AND person = 'dyer';

 * sqlite:///../data/survey.db
Done.

[('dyer', 2, 7.8, 8.81, 9.82)]

In [107]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'rad' AND person = 'lake';

 * sqlite:///../data/survey.db
Done.

[('lake', 2, 1.46, 1.825, 2.19)]

In [108]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'rad' AND person = 'roe';

 * sqlite:///../data/survey.db
Done.

[('roe', 1, 11.25, 11.25, 11.25)]

In [109]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'rad' AND person = 'pb';

 * sqlite:///../data/survey.db
Done.

[('pb', 3, 4.35, 6.659999999999999, 8.41)]

The above five queries can be combined into one query using `GROUP BY`!

In [110]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'rad'
GROUP BY person;

 * sqlite:///../data/survey.db
Done.

[('dyer', 2, 7.8, 8.81, 9.82),
 ('lake', 2, 1.46, 1.825, 2.19),
 ('pb', 3, 4.35, 6.659999999999999, 8.41),
 ('roe', 1, 11.25, 11.25, 11.25)]

In [111]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'sal'
GROUP BY person;

 * sqlite:///../data/survey.db
Done.

[(None, 1, 0.06, 0.06, 0.06),
 ('dyer', 2, 0.09, 0.11, 0.13),
 ('lake', 4, 0.05, 0.1125, 0.21),
 ('roe', 2, 22.5, 32.05, 41.6)]

In [112]:
%%sql
SELECT person, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE quant = 'temp'
GROUP BY person;

 * sqlite:///../data/survey.db
Done.

[(None, 1, -26.0, -26.0, -26.0),
 ('lake', 1, -16.0, -16.0, -16.0),
 ('pb', 2, -21.5, -20.0, -18.5)]

We can combine the above three queries into a single query!

In [113]:
%%sql
SELECT person, quant, count(reading), min(reading), avg(reading), max(reading) FROM Survey
GROUP BY person, quant;

 * sqlite:///../data/survey.db
Done.

[(None, 'sal', 1, 0.06, 0.06, 0.06),
 (None, 'temp', 1, -26.0, -26.0, -26.0),
 ('dyer', 'rad', 2, 7.8, 8.81, 9.82),
 ('dyer', 'sal', 2, 0.09, 0.11, 0.13),
 ('lake', 'rad', 2, 1.46, 1.825, 2.19),
 ('lake', 'sal', 4, 0.05, 0.1125, 0.21),
 ('lake', 'temp', 1, -16.0, -16.0, -16.0),
 ('pb', 'rad', 3, 4.35, 6.659999999999999, 8.41),
 ('pb', 'temp', 2, -21.5, -20.0, -18.5),
 ('roe', 'rad', 1, 11.25, 11.25, 11.25),
 ('roe', 'sal', 2, 22.5, 32.05, 41.6)]

In [114]:
%%sql
SELECT person, quant, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE person IS NOT NULL
GROUP BY person, quant;

 * sqlite:///../data/survey.db
Done.

[('dyer', 'rad', 2, 7.8, 8.81, 9.82),
 ('dyer', 'sal', 2, 0.09, 0.11, 0.13),
 ('lake', 'rad', 2, 1.46, 1.825, 2.19),
 ('lake', 'sal', 4, 0.05, 0.1125, 0.21),
 ('lake', 'temp', 1, -16.0, -16.0, -16.0),
 ('pb', 'rad', 3, 4.35, 6.659999999999999, 8.41),
 ('pb', 'temp', 2, -21.5, -20.0, -18.5),
 ('roe', 'rad', 1, 11.25, 11.25, 11.25),
 ('roe', 'sal', 2, 22.5, 32.05, 41.6)]

Let's breakdown the execution of the above query.

In [115]:
%%sql
SELECT * FROM Survey
WHERE person IS NOT NULL;

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'rad', 9.82),
 (619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'rad', 7.8),
 (622, 'dyer', 'sal', 0.09),
 (734, 'pb', 'rad', 8.41),
 (734, 'lake', 'sal', 0.05),
 (734, 'pb', 'temp', -21.5),
 (735, 'pb', 'rad', 7.22),
 (751, 'pb', 'rad', 4.35),
 (751, 'pb', 'temp', -18.5),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [117]:
%%sql
SELECT person, quant FROM Survey
WHERE person IS NOT NULL
GROUP BY person, quant;

 * sqlite:///../data/survey.db
Done.

[('dyer', 'rad'),
 ('dyer', 'sal'),
 ('lake', 'rad'),
 ('lake', 'sal'),
 ('lake', 'temp'),
 ('pb', 'rad'),
 ('pb', 'temp'),
 ('roe', 'rad'),
 ('roe', 'sal')]

In [118]:
%%sql
SELECT person, quant, count(reading), min(reading), avg(reading), max(reading) FROM Survey
WHERE person IS NOT NULL
GROUP BY person, quant;

 * sqlite:///../data/survey.db
Done.

[('dyer', 'rad', 2, 7.8, 8.81, 9.82),
 ('dyer', 'sal', 2, 0.09, 0.11, 0.13),
 ('lake', 'rad', 2, 1.46, 1.825, 2.19),
 ('lake', 'sal', 4, 0.05, 0.1125, 0.21),
 ('lake', 'temp', 1, -16.0, -16.0, -16.0),
 ('pb', 'rad', 3, 4.35, 6.659999999999999, 8.41),
 ('pb', 'temp', 2, -21.5, -20.0, -18.5),
 ('roe', 'rad', 1, 11.25, 11.25, 11.25),
 ('roe', 'sal', 2, 22.5, 32.05, 41.6)]

Performing the above, more comlex query in the database is likely MUCH faster than extracting results using a simple query and peforming aggregation in Pandas. **Rule of thumb: push as much computation into the database as possible to maximize efficiency!**

In [119]:
%%sql
SELECT * FROM Survey;

 * sqlite:///../data/survey.db
Done.

[(619, 'dyer', 'rad', 9.82),
 (619, 'dyer', 'sal', 0.13),
 (622, 'dyer', 'rad', 7.8),
 (622, 'dyer', 'sal', 0.09),
 (734, 'pb', 'rad', 8.41),
 (734, 'lake', 'sal', 0.05),
 (734, 'pb', 'temp', -21.5),
 (735, 'pb', 'rad', 7.22),
 (735, None, 'sal', 0.06),
 (735, None, 'temp', -26.0),
 (751, 'pb', 'rad', 4.35),
 (751, 'pb', 'temp', -18.5),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

## Combining Data

In [121]:
%%sql
SELECT * FROM Site;

 * sqlite:///../data/survey.db
Done.

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [122]:
%%sql
SELECT * FROM Visited;

 * sqlite:///../data/survey.db
Done.

[(619, 'DR-1', '1927-02-08'),
 (622, 'DR-1', '1927-02-10'),
 (734, 'DR-3', '1930-01-07'),
 (735, 'DR-3', '1930-01-12'),
 (751, 'DR-3', '1930-02-26'),
 (752, 'DR-3', None),
 (837, 'MSK-4', '1932-01-14'),
 (844, 'DR-1', '1932-03-22')]

In [120]:
%%sql
SELECT * FROM Site JOIN Visited;

 * sqlite:///../data/survey.db
Done.

[('DR-1', -49.85, -128.57, 619, 'DR-1', '1927-02-08'),
 ('DR-1', -49.85, -128.57, 622, 'DR-1', '1927-02-10'),
 ('DR-1', -49.85, -128.57, 734, 'DR-3', '1930-01-07'),
 ('DR-1', -49.85, -128.57, 735, 'DR-3', '1930-01-12'),
 ('DR-1', -49.85, -128.57, 751, 'DR-3', '1930-02-26'),
 ('DR-1', -49.85, -128.57, 752, 'DR-3', None),
 ('DR-1', -49.85, -128.57, 837, 'MSK-4', '1932-01-14'),
 ('DR-1', -49.85, -128.57, 844, 'DR-1', '1932-03-22'),
 ('DR-3', -47.15, -126.72, 619, 'DR-1', '1927-02-08'),
 ('DR-3', -47.15, -126.72, 622, 'DR-1', '1927-02-10'),
 ('DR-3', -47.15, -126.72, 734, 'DR-3', '1930-01-07'),
 ('DR-3', -47.15, -126.72, 735, 'DR-3', '1930-01-12'),
 ('DR-3', -47.15, -126.72, 751, 'DR-3', '1930-02-26'),
 ('DR-3', -47.15, -126.72, 752, 'DR-3', None),
 ('DR-3', -47.15, -126.72, 837, 'MSK-4', '1932-01-14'),
 ('DR-3', -47.15, -126.72, 844, 'DR-1', '1932-03-22'),
 ('MSK-4', -48.87, -123.4, 619, 'DR-1', '1927-02-08'),
 ('MSK-4', -48.87, -123.4, 622, 'DR-1', '1927-02-10'),
 ('MSK-4', -48.87, -123.4, 734, 'DR-3', '1930-01-07'),
 ('MSK-4', -48.87, -123.4, 735, 'DR-3', '1930-01-12'),
 ('MSK-4', -48.87, -123.4, 751, 'DR-3', '1930-02-26'),
 ('MSK-4', -48.87, -123.4, 752, 'DR-3', None),
 ('MSK-4', -48.87, -123.4, 837, 'MSK-4', '1932-01-14'),
 ('MSK-4', -48.87, -123.4, 844, 'DR-1', '1932-03-22')]

In [123]:
%%sql
SELECT * FROM Site JOIN Visited ON Site.name = Visited.site;

 * sqlite:///../data/survey.db
Done.

[('DR-1', -49.85, -128.57, 619, 'DR-1', '1927-02-08'),
 ('DR-1', -49.85, -128.57, 622, 'DR-1', '1927-02-10'),
 ('DR-1', -49.85, -128.57, 844, 'DR-1', '1932-03-22'),
 ('DR-3', -47.15, -126.72, 734, 'DR-3', '1930-01-07'),
 ('DR-3', -47.15, -126.72, 735, 'DR-3', '1930-01-12'),
 ('DR-3', -47.15, -126.72, 751, 'DR-3', '1930-02-26'),
 ('DR-3', -47.15, -126.72, 752, 'DR-3', None),
 ('MSK-4', -48.87, -123.4, 837, 'MSK-4', '1932-01-14')]

In [125]:
%%sql
SELECT * FROM Site JOIN Visited JOIN Survey 
ON Site.name = Visited.site
AND Visited.id = Survey.taken
AND Visited.dated IS NOT NULL;

 * sqlite:///../data/survey.db
Done.

[('DR-1', -49.85, -128.57, 619, 'DR-1', '1927-02-08', 619, 'dyer', 'rad', 9.82),
 ('DR-1', -49.85, -128.57, 619, 'DR-1', '1927-02-08', 619, 'dyer', 'sal', 0.13),
 ('DR-1', -49.85, -128.57, 622, 'DR-1', '1927-02-10', 622, 'dyer', 'rad', 7.8),
 ('DR-1', -49.85, -128.57, 622, 'DR-1', '1927-02-10', 622, 'dyer', 'sal', 0.09),
 ('DR-3', -47.15, -126.72, 734, 'DR-3', '1930-01-07', 734, 'lake', 'sal', 0.05),
 ('DR-3', -47.15, -126.72, 734, 'DR-3', '1930-01-07', 734, 'pb', 'rad', 8.41),
 ('DR-3', -47.15, -126.72, 734, 'DR-3', '1930-01-07', 734, 'pb', 'temp', -21.5),
 ('DR-3', -47.15, -126.72, 735, 'DR-3', '1930-01-12', 735, None, 'sal', 0.06),
 ('DR-3', -47.15, -126.72, 735, 'DR-3', '1930-01-12', 735, None, 'temp', -26.0),
 ('DR-3', -47.15, -126.72, 735, 'DR-3', '1930-01-12', 735, 'pb', 'rad', 7.22),
 ('DR-3', -47.15, -126.72, 751, 'DR-3', '1930-02-26', 751, 'lake', 'sal', 0.1),
 ('DR-3', -47.15, -126.72, 751, 'DR-3', '1930-02-26', 751, 'pb', 'rad', 4.35),
 ('DR-3', -47.15, -126.72, 751, 'DR-3', '1930-02-26', 751, 'pb', 'temp', -18.5),
 ('MSK-4', -48.87, -123.4, 837, 'MSK-4', '1932-01-14', 837, 'lake', 'rad', 1.46),
 ('MSK-4', -48.87, -123.4, 837, 'MSK-4', '1932-01-14', 837, 'lake', 'sal', 0.21),
 ('MSK-4', -48.87, -123.4, 837, 'MSK-4', '1932-01-14', 837, 'roe', 'sal', 22.5),
 ('DR-1', -49.85, -128.57, 844, 'DR-1', '1932-03-22', 844, 'roe', 'rad', 11.25)]

In [126]:
%%sql
SELECT Site.lat, Site.long, Visited.dated, Survey.quant, Survey.reading
FROM Site JOIN Visited JOIN Survey 
ON Site.name = Visited.site
AND Visited.id = Survey.taken
AND Visited.dated IS NOT NULL;

 * sqlite:///../data/survey.db
Done.

[(-49.85, -128.57, '1927-02-08', 'rad', 9.82),
 (-49.85, -128.57, '1927-02-08', 'sal', 0.13),
 (-49.85, -128.57, '1927-02-10', 'rad', 7.8),
 (-49.85, -128.57, '1927-02-10', 'sal', 0.09),
 (-47.15, -126.72, '1930-01-07', 'rad', 8.41),
 (-47.15, -126.72, '1930-01-07', 'sal', 0.05),
 (-47.15, -126.72, '1930-01-07', 'temp', -21.5),
 (-47.15, -126.72, '1930-01-12', 'rad', 7.22),
 (-47.15, -126.72, '1930-01-12', 'sal', 0.06),
 (-47.15, -126.72, '1930-01-12', 'temp', -26.0),
 (-47.15, -126.72, '1930-02-26', 'rad', 4.35),
 (-47.15, -126.72, '1930-02-26', 'sal', 0.1),
 (-47.15, -126.72, '1930-02-26', 'temp', -18.5),
 (-48.87, -123.4, '1932-01-14', 'rad', 1.46),
 (-48.87, -123.4, '1932-01-14', 'sal', 0.21),
 (-48.87, -123.4, '1932-01-14', 'sal', 22.5),
 (-49.85, -128.57, '1932-03-22', 'rad', 11.25)]

In [129]:
%%sql
SELECT Site.lat, Site.long, Visited.dated, Survey.quant, Survey.reading
FROM Site JOIN Visited JOIN Survey 
ON Site.name = Visited.site AND Visited.id = Survey.taken AND Visited.dated IS NOT NULL
WHERE Survey.reading > 0.0;

 * sqlite:///../data/survey.db
Done.

[(-49.85, -128.57, '1927-02-08', 'rad', 9.82),
 (-49.85, -128.57, '1927-02-08', 'sal', 0.13),
 (-49.85, -128.57, '1927-02-10', 'rad', 7.8),
 (-49.85, -128.57, '1927-02-10', 'sal', 0.09),
 (-47.15, -126.72, '1930-01-07', 'rad', 8.41),
 (-47.15, -126.72, '1930-01-07', 'sal', 0.05),
 (-47.15, -126.72, '1930-01-12', 'rad', 7.22),
 (-47.15, -126.72, '1930-01-12', 'sal', 0.06),
 (-47.15, -126.72, '1930-02-26', 'rad', 4.35),
 (-47.15, -126.72, '1930-02-26', 'sal', 0.1),
 (-48.87, -123.4, '1932-01-14', 'rad', 1.46),
 (-48.87, -123.4, '1932-01-14', 'sal', 0.21),
 (-48.87, -123.4, '1932-01-14', 'sal', 22.5),
 (-49.85, -128.57, '1932-03-22', 'rad', 11.25)]